TF Plan for sandbox

Terraform will perform the following actions:

  # module.main.aws_cloudtrail.cloudtrail will be updated in-place
  ~ resource "aws_cloudtrail" "cloudtrail" {
        arn                           = "arn:aws:cloudtrail:us-west-2:894947205914:trail/login-gov-cloudtrail"
        cloud_watch_logs_group_arn    = "arn:aws:logs:us-west-2:894947205914:log-group:CloudTrail/DefaultLogGroup:*"
        cloud_watch_logs_role_arn     = "arn:aws:iam::894947205914:role/CloudTrail_CloudWatchLogs_Role"
        enable_log_file_validation    = true
        enable_logging                = true
        home_region                   = "us-west-2"
        id                            = "login-gov-cloudtrail"
        include_global_service_events = true
        is_multi_region_trail         = true
        is_organization_trail         = false
        name                          = "login-gov-cloudtrail"
        s3_bucket_name                = "login-gov-cloudtrail-894947205914"
        tags                          = {}

      ~ event_selector {
            include_management_events = false
            read_write_type           = "WriteOnly"

          ~ data_resource {
                type   = "AWS::S3::Object"
              ~ values = [
                    "arn:aws:s3:::894947205914-awsmacietrail-dataevent/",
                    "arn:aws:s3:::cf-templates-1am4wkz4zazy5-us-west-2/",
                    "arn:aws:s3:::codebuild-imagebaserole-outputbucket-k3ulvdsui2sy/",
                  - "arn:aws:s3:::config-bucket-894947205914/",
                    "arn:aws:s3:::dev-s3-access-logs/",
                    "arn:aws:s3:::login-gov-cloudformation/",
                  - "arn:aws:s3:::login-gov-cloudtrail-894947205914/",
                    "arn:aws:s3:::login-gov.internal-certs.894947205914-us-west-2/",
                ]
            }
        }
        event_selector {
            include_management_events = true
            read_write_type           = "All"

            data_resource {
                type   = "AWS::S3::Object"
                values = [
                    "arn:aws:s3",
                ]
            }
            data_resource {
                type   = "AWS::Lambda::Function"
                values = [
                    "arn:aws:lambda:us-west-2:894947205914:function:AWSWAFSecurityAutomations-LambdaWAFBadBotParserFun-ET6X7V1I3DM0",
                    "arn:aws:lambda:us-west-2:894947205914:function:AWSWAFSecurityAutomations-LambdaWAFCustomResourceF-HKDTQ8JTMFG1",
                    "arn:aws:lambda:us-west-2:894947205914:function:AWSWAFSecurityAutomations-LambdaWAFLogParserFuncti-146DZLZUWOJB8",
                    "arn:aws:lambda:us-west-2:894947205914:function:AWSWAFSecurityAutomations-LambdaWAFReputationLists-1R1JGJLKECSJ8",
                    "arn:aws:lambda:us-west-2:894947205914:function:AWSWAFSecurityAutomations-SolutionHelper-1S5I50MC6C8RO",
                    "arn:aws:lambda:us-west-2:894947205914:function:CodeSync-IdentityBaseImag-DeleteBucketContentsLamb-1FRT9DA59TRRO",
                    "arn:aws:lambda:us-west-2:894947205914:function:CodeSync-IdentityBaseImage-CopyZipsFunction-1DRZ0M4JN6212",
                    "arn:aws:lambda:us-west-2:894947205914:function:CodeSync-IdentityBaseImage-CreateSSHKeyLambda-WYHZYK8MNCVP",
                    "arn:aws:lambda:us-west-2:894947205914:function:CodeSync-IdentityBaseImage-GitPullLambda-1Q1M505YQ8IS7",
                    "arn:aws:lambda:us-west-2:894947205914:function:CodeSync-IdentityBaseImage-ZipDlLambda-F96DI7VMXL0W",
                    "arn:aws:lambda:us-west-2:894947205914:function:ConfigRulesTurnedON",
                    "arn:aws:lambda:us-west-2:894947205914:function:GuardDutyFireEyeDemo1-CopyLambdaCodeFunction-1WM4760XXBY47",
                    "arn:aws:lambda:us-west-2:894947205914:function:GuardDutyFireEyeDemo1-GDThreatFeedFunction-1Q5AVV8WVH7QD",
                    "arn:aws:lambda:us-west-2:894947205914:function:LogsToElasticsearch_crissupb-es",
                    "arn:aws:lambda:us-west-2:894947205914:function:Test",
                    "arn:aws:lambda:us-west-2:894947205914:function:TestCloudWatchToSlack",
                    "arn:aws:lambda:us-west-2:894947205914:function:UpdateASGWithNewAmi",
                    "arn:aws:lambda:us-west-2:894947205914:function:ami_cleanup",
                    "arn:aws:lambda:us-west-2:894947205914:function:brody-manual-test-slack-hook-delete-after-2018-09-01",
                    "arn:aws:lambda:us-west-2:894947205914:function:crissup-test-cloudwatch",
                    "arn:aws:lambda:us-west-2:894947205914:function:crissupb-test-parse-cloudwatch",
                    "arn:aws:lambda:us-west-2:894947205914:function:fn_CloudTrailResponder",
                    "arn:aws:lambda:us-west-2:894947205914:function:fn_ConfigRulesTurnedON",
                    "arn:aws:lambda:us-west-2:894947205914:function:fn_VPCFLDetection",
                    "arn:aws:lambda:us-west-2:894947205914:function:identity-idp-account-reset-notifications",
                    "arn:aws:lambda:us-west-2:894947205914:function:markjordantest",
                    "arn:aws:lambda:us-west-2:894947205914:function:s3-config",
                    "arn:aws:lambda:us-west-2:894947205914:function:storeToS3-tmp-test",
                    "arn:aws:lambda:us-west-2:894947205914:function:waf-alerts-WafLambdaFunction",
                ]
            }
        }
    }

  # module.main.aws_cloudwatch_event_rule.root_user_accessed will be created
  + resource "aws_cloudwatch_event_rule" "root_user_accessed" {
      + arn           = (known after apply)
      + description   = "AWS Root account accessed"
      + event_pattern = jsonencode(
            {
              + detail      = {
                  + userIdentity = {
                      + type = [
                          + "Root",
                        ]
                    }
                }
              + detail-type = [
                  + "AWS API Call via CloudTrail",
                  + "AWS Console Sign In via CloudTrail",
                ]
            }
        )
      + id            = (known after apply)
      + is_enabled    = true
      + name          = "account-root-user-accessed"
    }

  # module.main.aws_cloudwatch_event_target.opsgenie_root_user_accessed will be created
  + resource "aws_cloudwatch_event_target" "opsgenie_root_user_accessed" {
      + arn       = "arn:aws:sns:us-west-2:894947205914:opsgenie-alert"
      + id        = (known after apply)
      + role_arn  = (known after apply)
      + rule      = "account-root-user-accessed"
      + target_id = "SendToOpsGenie"
    }

  # module.main.aws_cloudwatch_event_target.slack_root_user_accessed will be created
  + resource "aws_cloudwatch_event_target" "slack_root_user_accessed" {
      + arn       = "arn:aws:sns:us-west-2:894947205914:slack-soc"
      + id        = (known after apply)
      + role_arn  = (known after apply)
      + rule      = "account-root-user-accessed"
      + target_id = "SendToSlack"
    }

  # module.main.aws_iam_role.root_user_accessed will be created
  + resource "aws_iam_role" "root_user_accessed" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Sid       = "AssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "account-root-user-notification-"
      + path                  = "/service-role/"
      + unique_id             = (known after apply)
    }

  # module.main.aws_iam_role_policy.root_user_accessed_base will be created
  + resource "aws_iam_role_policy" "root_user_accessed_base" {
      + id     = (known after apply)
      + name   = "base"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sns:Publish"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sns:us-west-2:894947205914:slack-soc",
                          + "arn:aws:sns:us-west-2:894947205914:opsgenie-alert",
                        ]
                      + Sid      = "base"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.main.module.cloudtrail_bucket_config.aws_s3_bucket_inventory.daily will be updated in-place
  ~ resource "aws_s3_bucket_inventory" "daily" {
        bucket                   = "login-gov-cloudtrail-894947205914"
        enabled                  = true
        id                       = "login-gov-cloudtrail-894947205914:FullBucketDailyInventory"
        included_object_versions = "All"
        name                     = "FullBucketDailyInventory"
      ~ optional_fields          = [
            "ETag",
            "EncryptionStatus",
          + "IntelligentTieringAccessTier",
          + "IsMultipartUploaded",
            "LastModifiedDate",
          + "ObjectLockLegalHoldStatus",
          + "ObjectLockMode",
          + "ObjectLockRetainUntilDate",
          + "ReplicationStatus",
          + "Size",
          + "StorageClass",
        ]

      ~ destination {
          ~ bucket {
                bucket_arn = "arn:aws:s3:::login-gov.s3-inventory.894947205914-us-west-2"
              ~ format     = "CSV" -> "Parquet"
            }
        }

        schedule {
            frequency = "Daily"
        }
    }

  # module.main.module.config_bucket_config.aws_s3_bucket_inventory.daily will be updated in-place
  ~ resource "aws_s3_bucket_inventory" "daily" {
        bucket                   = "config-bucket-894947205914"
        enabled                  = true
        id                       = "config-bucket-894947205914:FullBucketDailyInventory"
        included_object_versions = "All"
        name                     = "FullBucketDailyInventory"
      ~ optional_fields          = [
            "ETag",
            "EncryptionStatus",
          + "IntelligentTieringAccessTier",
          + "IsMultipartUploaded",
            "LastModifiedDate",
          + "ObjectLockLegalHoldStatus",
          + "ObjectLockMode",
          + "ObjectLockRetainUntilDate",
          + "ReplicationStatus",
          + "Size",
          + "StorageClass",
        ]

      ~ destination {
          ~ bucket {
                bucket_arn = "arn:aws:s3:::login-gov.s3-inventory.894947205914-us-west-2"
              ~ format     = "CSV" -> "Parquet"
            }
        }

        schedule {
            frequency = "Daily"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.access_keys_rotated will be created
  + resource "aws_config_config_rule" "access_keys_rotated" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + maxAccessKeyAge = "90"
            }
        )
      + name             = "fedramp-access-keys-rotated"
      + rule_id          = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "ACCESS_KEYS_ROTATED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.acm_certificate_expiration_check will be created
  + resource "aws_config_config_rule" "acm_certificate_expiration_check" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + daysToExpiration = "90"
            }
        )
      + name             = "fedramp-acm-certificate-expiration-check"
      + rule_id          = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ACM::Certificate",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ACM_CERTIFICATE_EXPIRATION_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.alb_http_drop_invalid_header_enabled will be created
  + resource "aws_config_config_rule" "alb_http_drop_invalid_header_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-alb-http-drop-invalid-header-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ElasticLoadBalancingV2::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ALB_HTTP_DROP_INVALID_HEADER_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.alb_http_to_https_redirection_check will be created
  + resource "aws_config_config_rule" "alb_http_to_https_redirection_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-alb-http-to-https-redirection-check"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "ALB_HTTP_TO_HTTPS_REDIRECTION_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.alb_waf_enabled will be created
  + resource "aws_config_config_rule" "alb_waf_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-alb-waf-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ElasticLoadBalancingV2::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ALB_WAF_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.api_gw_cache_enabled_and_encrypted will be created
  + resource "aws_config_config_rule" "api_gw_cache_enabled_and_encrypted" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-api-gw-cache-enabled-and-encrypted"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ApiGateway::Stage",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "API_GW_CACHE_ENABLED_AND_ENCRYPTED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.api_gw_execution_logging_enabled will be created
  + resource "aws_config_config_rule" "api_gw_execution_logging_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-api-gw-execution-logging-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ApiGateway::Stage",
              + "AWS::ApiGatewayV2::Stage",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "API_GW_EXECUTION_LOGGING_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.autoscaling_group_elb_health_check_required will be created
  + resource "aws_config_config_rule" "autoscaling_group_elb_health_check_required" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-autoscaling_group_elb_health_check_required"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::AutoScaling::AutoScalingGroup",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "AUTOSCALING_GROUP_ELB_HEALTHCHECK_REQUIRED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cloudtrail-cloudwatch-logs-enabled will be created
  + resource "aws_config_config_rule" "cloudtrail-cloudwatch-logs-enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-cloudtrail-cloudwatch-logs-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUD_TRAIL_CLOUD_WATCH_LOGS_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cloudtrail_enabled will be created
  + resource "aws_config_config_rule" "cloudtrail_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-cloudtrail-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUD_TRAIL_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cloudtrail_encryption_enabled will be created
  + resource "aws_config_config_rule" "cloudtrail_encryption_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-cloudtrail-encryption-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUD_TRAIL_ENCRYPTION_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cloudtrail_log_file_validation_enabled will be created
  + resource "aws_config_config_rule" "cloudtrail_log_file_validation_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-cloudtrail-log-file-validation-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUD_TRAIL_LOG_FILE_VALIDATION_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cloudtrail_s3_data_events_enabled will be created
  + resource "aws_config_config_rule" "cloudtrail_s3_data_events_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-cloudtrail-s3-data-events-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUDTRAIL_S3_DATAEVENTS_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cloudtrail_security_trail_enabled will be created
  + resource "aws_config_config_rule" "cloudtrail_security_trail_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-cloudtrail-security-trail-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUDTRAIL_SECURITY_TRAIL_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cloudwatch_alarm_action_check will be created
  + resource "aws_config_config_rule" "cloudwatch_alarm_action_check" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + alarmActionRequired            = "TRUE"
              + insufficientDataActionRequired = "TRUE"
              + okActionRequired               = "FALSE"
            }
        )
      + name             = "fedramp-cloudwatch-alarm-action-check"
      + rule_id          = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::CloudWatch::Alarm",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUDWATCH_ALARM_ACTION_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cloudwatch_log_group_encrypted will be created
  + resource "aws_config_config_rule" "cloudwatch_log_group_encrypted" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-cloudwatch-log-group-encrypted"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CLOUDWATCH_LOG_GROUP_ENCRYPTED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cmk_backing_key_rotation_enabled will be created
  + resource "aws_config_config_rule" "cmk_backing_key_rotation_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-cmk-backing-key-rotation-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CMK_BACKING_KEY_ROTATION_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.codebuild_project_envvar_awscred_check will be created
  + resource "aws_config_config_rule" "codebuild_project_envvar_awscred_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-codebuild-project-envvar-awscred-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::CodeBuild::Project",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "CODEBUILD_PROJECT_ENVVAR_AWSCRED_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.codebuild_project_source_repo_url_check will be created
  + resource "aws_config_config_rule" "codebuild_project_source_repo_url_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-codebuild-project-source-repo-url-check"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CODEBUILD_PROJECT_SOURCE_REPO_URL_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.cw_loggroup_retention_period_check will be created
  + resource "aws_config_config_rule" "cw_loggroup_retention_period_check" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + MinRetentionTime = "90"
            }
        )
      + name             = "fedramp-cw-loggroup-retention-period-check"
      + rule_id          = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "CW_LOGGROUP_RETENTION_PERIOD_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.db_instance_backup_enabled will be created
  + resource "aws_config_config_rule" "db_instance_backup_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-db-instance-backup-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::RDS::DBInstance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "DB_INSTANCE_BACKUP_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.dms_replication_not_public will be created
  + resource "aws_config_config_rule" "dms_replication_not_public" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-dms-replication-not-public"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "DMS_REPLICATION_NOT_PUBLIC"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.dynamodb_autoscaling_enabled will be created
  + resource "aws_config_config_rule" "dynamodb_autoscaling_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-dynamodb-autoscaling-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::DynamoDB::Table",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "DYNAMODB_AUTOSCALING_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.dynamodb_in_backup_plan will be created
  + resource "aws_config_config_rule" "dynamodb_in_backup_plan" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-dynamodb-in-backup-plan"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "DYNAMODB_IN_BACKUP_PLAN"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.dynamodb_pitr_enabled will be created
  + resource "aws_config_config_rule" "dynamodb_pitr_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-dynamodb-pitr-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::DynamoDB::Table",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "DYNAMODB_PITR_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.dynamodb_table_encrypted_kms will be created
  + resource "aws_config_config_rule" "dynamodb_table_encrypted_kms" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-dynamodb-table-encrypted-kms"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::DynamoDB::Table",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "DYNAMODB_TABLE_ENCRYPTED_KMS"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ebs_in_backup_plan will be created
  + resource "aws_config_config_rule" "ebs_in_backup_plan" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ebs-in-backup-plan"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "EBS_IN_BACKUP_PLAN"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ebs_snapshot_public_restorable_check will be created
  + resource "aws_config_config_rule" "ebs_snapshot_public_restorable_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ebs-snapshot-public-restorable-check"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "EBS_SNAPSHOT_PUBLIC_RESTORABLE_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2-volume-inuse-check will be created
  + resource "aws_config_config_rule" "ec2-volume-inuse-check" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + deleteOnTermination = "TRUE"
            }
        )
      + name             = "fedramp-ec2-volume-inuse-check"
      + rule_id          = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::Volume",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "EC2_VOLUME_INUSE_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2_ebs_encryption_by_default will be created
  + resource "aws_config_config_rule" "ec2_ebs_encryption_by_default" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ec2-ebs-encryption-by-default"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "EC2_EBS_ENCRYPTION_BY_DEFAULT"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2_imdsv2_check will be created
  + resource "aws_config_config_rule" "ec2_imdsv2_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ec2-imdsv2-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::Instance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "EC2_IMDSV2_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2_instance_detailed_monitoring_enabled will be created
  + resource "aws_config_config_rule" "ec2_instance_detailed_monitoring_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ec2-instance-detailed-monitoring-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::Instance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "EC2_INSTANCE_DETAILED_MONITORING_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2_instance_managed_by_systems_manager will be created
  + resource "aws_config_config_rule" "ec2_instance_managed_by_systems_manager" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ec2-instance-managed-by-systems-manager"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::Instance",
              + "AWS::SSM::ManagedInstanceInventory",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "EC2_INSTANCE_MANAGED_BY_SSM"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2_instance_no_public_ip will be created
  + resource "aws_config_config_rule" "ec2_instance_no_public_ip" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ec2-instance-no-public-ip"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::Instance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "EC2_INSTANCE_NO_PUBLIC_IP"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2_instances_in_vpc will be created
  + resource "aws_config_config_rule" "ec2_instances_in_vpc" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ec2-instances-in-vpc"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::Instance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "INSTANCES_IN_VPC"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2_managedinstance_association_compliance_status_check will be created
  + resource "aws_config_config_rule" "ec2_managedinstance_association_compliance_status_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ec2-managedinstance-association-compliance-status-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "EC2_MANAGEDINSTANCE_ASSOCIATION_COMPLIANCE_STATUS_CHECK",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "AWS::SSM::AssociationCompliance"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2_managedinstance_patch_compliance_status_check will be created
  + resource "aws_config_config_rule" "ec2_managedinstance_patch_compliance_status_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-c2-managedinstance-patch-compliance-status-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::SSM::PatchCompliance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "EC2_MANAGEDINSTANCE_PATCH_COMPLIANCE_STATUS_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.ec2_stopped_instance will be created
  + resource "aws_config_config_rule" "ec2_stopped_instance" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ec2-stopped-instance"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "EC2_STOPPED_INSTANCE"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.efs_encrypted_check will be created
  + resource "aws_config_config_rule" "efs_encrypted_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-efs-encrypted-check"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "EFS_ENCRYPTED_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.efs_in_backup_plan will be created
  + resource "aws_config_config_rule" "efs_in_backup_plan" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-efs-in-backup-plan"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "EFS_IN_BACKUP_PLAN"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.elasticache_redis_cluster_automatic_backup_check will be created
  + resource "aws_config_config_rule" "elasticache_redis_cluster_automatic_backup_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-elasticache-redis-cluster-automatic-backup-check"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "ELASTICACHE_REDIS_CLUSTER_AUTOMATIC_BACKUP_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.elasticsearch_encrypted_at_rest will be created
  + resource "aws_config_config_rule" "elasticsearch_encrypted_at_rest" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-elasticsearch-encrypted-at-rest"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "ELASTICSEARCH_ENCRYPTED_AT_REST"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.elasticsearch_in_vpc_only will be created
  + resource "aws_config_config_rule" "elasticsearch_in_vpc_only" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-elasticsearch-in-vpc-only"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "ELASTICSEARCH_IN_VPC_ONLY"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.elasticsearch_node_to_node_encryption_check will be created
  + resource "aws_config_config_rule" "elasticsearch_node_to_node_encryption_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-elasticsearch-node-to-node-encryption-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::Elasticsearch::Domain",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ELASTICSEARCH_NODE_TO_NODE_ENCRYPTION_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.elb_acm_certificate_required will be created
  + resource "aws_config_config_rule" "elb_acm_certificate_required" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-elb-acm-certificate-required"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ElasticLoadBalancing::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ELB_ACM_CERTIFICATE_REQUIRED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.elb_cross_zone_load_balancing_enabled will be created
  + resource "aws_config_config_rule" "elb_cross_zone_load_balancing_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-elb-cross-zone-load-balancing-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "ELB_CROSS_ZONE_LOAD_BALANCING_ENABLED",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "AWS::ElasticLoadBalancing::LoadBalancer"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.elb_deletion_protection_enabled will be created
  + resource "aws_config_config_rule" "elb_deletion_protection_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-elb-deletion-protection-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ElasticLoadBalancingV2::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ELB_DELETION_PROTECTION_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.elb_logging_enabled will be created
  + resource "aws_config_config_rule" "elb_logging_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-elb-logging-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ElasticLoadBalancing::LoadBalancer",
              + "AWS::ElasticLoadBalancingV2::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ELB_LOGGING_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.elb_tls_https_listeners_only will be created
  + resource "aws_config_config_rule" "elb_tls_https_listeners_only" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-elb-tls-https-listeners-only"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::ElasticLoadBalancing::LoadBalancer",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ELB_TLS_HTTPS_LISTENERS_ONLY"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.emr_kerberos_enabled will be created
  + resource "aws_config_config_rule" "emr_kerberos_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-emr-kerberos-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "EMR_KERBEROS_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.emr_master_no_public_ip will be created
  + resource "aws_config_config_rule" "emr_master_no_public_ip" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-emr-master-no-public-ip"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "EMR_MASTER_NO_PUBLIC_IP"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.encrypted-volumes will be created
  + resource "aws_config_config_rule" "encrypted-volumes" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-encrypted-volumes"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::Volume",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "ENCRYPTED_VOLUMES"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.guardduty_enabled_centralized will be created
  + resource "aws_config_config_rule" "guardduty_enabled_centralized" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-guardduty-enabled-centralized"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "GUARDDUTY_ENABLED_CENTRALIZED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.guardduty_non_archived_findings will be created
  + resource "aws_config_config_rule" "guardduty_non_archived_findings" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + daysHighSev   = "30"
              + daysLowSev    = "180"
              + daysMediumSev = "90"
            }
        )
      + name             = "fedramp-guardduty-non-archived-findings"
      + rule_id          = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "GUARDDUTY_NON_ARCHIVED_FINDINGS"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.iam_group_has_users_check will be created
  + resource "aws_config_config_rule" "iam_group_has_users_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-iam-group-has-users-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::IAM::Group",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_GROUP_HAS_USERS_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.iam_no_inline_policy_check will be created
  + resource "aws_config_config_rule" "iam_no_inline_policy_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-iam-no-inline-policy-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::IAM::Group",
              + "AWS::IAM::Role",
              + "AWS::IAM::User",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_NO_INLINE_POLICY_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.iam_password_policy will be created
  + resource "aws_config_config_rule" "iam_password_policy" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + MaxPasswordAge             = "90"
              + MinimumPasswordLength      = "14"
              + PasswordReusePrevention    = "24"
              + RequireLowercaseCharacters = "TRUE"
              + RequireNumbers             = "TRUE"
              + RequireSymbols             = "TRUE"
              + RequireUppercaseCharacters = "TRUE"
            }
        )
      + name             = "fedramp-iam-password-policy"
      + rule_id          = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_PASSWORD_POLICY"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.iam_policy_no_statements_with_admin_access will be created
  + resource "aws_config_config_rule" "iam_policy_no_statements_with_admin_access" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-iam-policy-no-statements-with-admin-access"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::IAM::Policy",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_POLICY_NO_STATEMENTS_WITH_ADMIN_ACCESS"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.iam_root_access_key_check will be created
  + resource "aws_config_config_rule" "iam_root_access_key_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-iam-root-access-key-check"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_ROOT_ACCESS_KEY_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.iam_user_group_membership_check will be created
  + resource "aws_config_config_rule" "iam_user_group_membership_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-iam-user-group-membership-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::IAM::User",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_USER_GROUP_MEMBERSHIP_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.iam_user_mfa_enabled will be created
  + resource "aws_config_config_rule" "iam_user_mfa_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-iam-user-mfa-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_USER_MFA_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.iam_user_no_policies_check will be created
  + resource "aws_config_config_rule" "iam_user_no_policies_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-iam-user-no-policies-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::IAM::User",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_USER_NO_POLICIES_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.iam_user_unused_credentials_check will be created
  + resource "aws_config_config_rule" "iam_user_unused_credentials_check" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + maxCredentialUsageAge = "90"
            }
        )
      + name             = "fedramp-iam-user-unused-credentials-check"
      + rule_id          = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_USER_UNUSED_CREDENTIALS_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.internet_gateway_authorized_vpc_only will be created
  + resource "aws_config_config_rule" "internet_gateway_authorized_vpc_only" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-internet-gateway-authorized-vpc-only"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::InternetGateway",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "INTERNET_GATEWAY_AUTHORIZED_VPC_ONLY"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.kms_cmk_not_scheduled_for_deletion will be created
  + resource "aws_config_config_rule" "kms_cmk_not_scheduled_for_deletion" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-kms-cmk-not-scheduled-for-deletion"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::KMS::Key",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "KMS_CMK_NOT_SCHEDULED_FOR_DELETION"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.lambda_function_public_access_prohibited will be created
  + resource "aws_config_config_rule" "lambda_function_public_access_prohibited" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-lambda-function-public-access-prohibited"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::Lambda::Function",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "LAMBDA_FUNCTION_PUBLIC_ACCESS_PROHIBITED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.lambda_inside_vpc will be created
  + resource "aws_config_config_rule" "lambda_inside_vpc" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-lambda-inside-vpc"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::Lambda::Function",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "LAMBDA_INSIDE_VPC"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.mfa_enabled_for_iam_console_access will be created
  + resource "aws_config_config_rule" "mfa_enabled_for_iam_console_access" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-mfa-enabled-for-iam-console-access"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "MFA_ENABLED_FOR_IAM_CONSOLE_ACCESS"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.multi_region_cloudtrail_enabled will be created
  + resource "aws_config_config_rule" "multi_region_cloudtrail_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-multi-region-cloudtrail-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "MULTI_REGION_CLOUD_TRAIL_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.rds_enhanced_monitoring_enabled will be created
  + resource "aws_config_config_rule" "rds_enhanced_monitoring_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-rds-enhanced-monitoring-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::RDS::DBInstance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "RDS_ENHANCED_MONITORING_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.rds_in_backup_plan will be created
  + resource "aws_config_config_rule" "rds_in_backup_plan" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-rds-in-backup-plan"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "RDS_IN_BACKUP_PLAN"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.rds_instance_deletion_protection_enabled will be created
  + resource "aws_config_config_rule" "rds_instance_deletion_protection_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-rds-instance-deletion-protection-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::RDS::DBInstance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "RDS_INSTANCE_DELETION_PROTECTION_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.rds_instance_public_access_check will be created
  + resource "aws_config_config_rule" "rds_instance_public_access_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-rds-instance-public-access-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::RDS::DBInstance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "RDS_INSTANCE_PUBLIC_ACCESS_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.rds_logging_enabled will be created
  + resource "aws_config_config_rule" "rds_logging_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-rds-logging-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::RDS::DBInstance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "RDS_LOGGING_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.rds_multi_az_support will be created
  + resource "aws_config_config_rule" "rds_multi_az_support" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-rds-multi-az-support"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::RDS::DBInstance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "RDS_MULTI_AZ_SUPPORT"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.rds_snapshot_encrypted will be created
  + resource "aws_config_config_rule" "rds_snapshot_encrypted" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-rds-snapshot-encrypted"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::RDS::DBClusterSnapshot",
              + "AWS::RDS::DBSnapshot",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "RDS_SNAPSHOT_ENCRYPTED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.rds_snapshots_public_prohibited will be created
  + resource "aws_config_config_rule" "rds_snapshots_public_prohibited" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-ds-snapshots-public-prohibited"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::RDS::DBClusterSnapshot",
              + "AWS::RDS::DBSnapshot",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "RDS_SNAPSHOTS_PUBLIC_PROHIBITED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.rds_storage_encrypted will be created
  + resource "aws_config_config_rule" "rds_storage_encrypted" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-rds-storage-encrypted"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::RDS::DBInstance",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "RDS_STORAGE_ENCRYPTED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.redshift_cluster_configuration_check will be created
  + resource "aws_config_config_rule" "redshift_cluster_configuration_check" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + clusterDbEncrypted = "TRUE"
              + loggingEnabled     = "TRUE"
            }
        )
      + name             = "fedramp-redshift-cluster-configuration-check"
      + rule_id          = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::Redshift::Cluster",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "REDSHIFT_CLUSTER_CONFIGURATION_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.redshift_cluster_public_access_check will be created
  + resource "aws_config_config_rule" "redshift_cluster_public_access_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-redshift-cluster-public-access-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::Redshift::Cluster",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "REDSHIFT_CLUSTER_PUBLIC_ACCESS_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.redshift_require_tls_ssl will be created
  + resource "aws_config_config_rule" "redshift_require_tls_ssl" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-redshift-require-tls-ssl"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::Redshift::Cluster",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "REDSHIFT_REQUIRE_TLS_SSL"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.restricted-ssh will be created
  + resource "aws_config_config_rule" "restricted-ssh" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-restricted-ssh"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::SecurityGroup",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "INCOMING_SSH_DISABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.restricted_common_ports will be created
  + resource "aws_config_config_rule" "restricted_common_ports" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + blockedPort1 = "20"
              + blockedPort2 = "21"
              + blockedPort3 = "3389"
              + blockedPort4 = "3306"
              + blockedPort5 = "4333"
            }
        )
      + name             = "fedramp-restricted-common-ports"
      + rule_id          = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::SecurityGroup",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "RESTRICTED_INCOMING_TRAFFIC"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.root_account_hardware_mfa_enabled will be created
  + resource "aws_config_config_rule" "root_account_hardware_mfa_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-root-account-hardware-mfa-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "ROOT_ACCOUNT_HARDWARE_MFA_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.root_account_mfa_enabled will be created
  + resource "aws_config_config_rule" "root_account_mfa_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-root-account-mfa-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "ROOT_ACCOUNT_MFA_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_account_level_public_access_blocks will be created
  + resource "aws_config_config_rule" "s3_account_level_public_access_blocks" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + BlockPublicAcls       = "TRUE"
              + BlockPublicPolicy     = "TRUE"
              + IgnorePublicAcls      = "TRUE"
              + RestrictPublicBuckets = "TRUE"
            }
        )
      + name             = "fedramp-s3-account-level-public-access-blocks"
      + rule_id          = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::AccountPublicAccessBlock",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_ACCOUNT_LEVEL_PUBLIC_ACCESS_BLOCKS"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_bucket_default_lock_enabled will be created
  + resource "aws_config_config_rule" "s3_bucket_default_lock_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-s3-bucket-default-lock-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_DEFAULT_LOCK_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_bucket_logging_enabled will be created
  + resource "aws_config_config_rule" "s3_bucket_logging_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-s3-bucket-logging-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_LOGGING_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_bucket_policy_grantee_check will be created
  + resource "aws_config_config_rule" "s3_bucket_policy_grantee_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-s3-bucket-policy-grantee-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_POLICY_GRANTEE_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_bucket_public_read_prohibited will be created
  + resource "aws_config_config_rule" "s3_bucket_public_read_prohibited" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-s3-bucket-public-read-prohibited"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_PUBLIC_READ_PROHIBITED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_bucket_public_write_prohibited will be created
  + resource "aws_config_config_rule" "s3_bucket_public_write_prohibited" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-s3-bucket-public-write-prohibited"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_PUBLIC_WRITE_PROHIBITED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_bucket_replication_enabled will be created
  + resource "aws_config_config_rule" "s3_bucket_replication_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-s3-bucket-replication-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_REPLICATION_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_bucket_server_side_encryption_enabled will be created
  + resource "aws_config_config_rule" "s3_bucket_server_side_encryption_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-s3-bucket-server-side-encryption-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "S3_BUCKET_SERVER_SIDE_ENCRYPTION_ENABLED",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "AWS::S3::Bucket"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_bucket_ssl_requests_only will be created
  + resource "aws_config_config_rule" "s3_bucket_ssl_requests_only" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-s3-bucket-ssl-requests-only"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_SSL_REQUESTS_ONLY"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.s3_bucket_versioning_enabled will be created
  + resource "aws_config_config_rule" "s3_bucket_versioning_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-s3-bucket-versioning-enabled"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::S3::Bucket",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "S3_BUCKET_VERSIONING_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.sagemaker_endpoint_configuration_kms_key_configured will be created
  + resource "aws_config_config_rule" "sagemaker_endpoint_configuration_kms_key_configured" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-sagemaker-endpoint-configuration-kms-key-configured"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "SAGEMAKER_ENDPOINT_CONFIGURATION_KMS_KEY_CONFIGURED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.sagemaker_notebook_instance_kms_key_configured will be created
  + resource "aws_config_config_rule" "sagemaker_notebook_instance_kms_key_configured" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-sagemaker-notebook-instance-kms-key-configured"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "SAGEMAKER_NOTEBOOK_INSTANCE_KMS_KEY_CONFIGURED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.sagemaker_notebook_no_direct_internet_access will be created
  + resource "aws_config_config_rule" "sagemaker_notebook_no_direct_internet_access" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-sagemaker-notebook-no-direct-internet-access"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "SAGEMAKER_NOTEBOOK_NO_DIRECT_INTERNET_ACCESS"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.secretsmanager_scheduled_rotation_success_check will be created
  + resource "aws_config_config_rule" "secretsmanager_scheduled_rotation_success_check" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-secretsmanager-scheduled-rotation-success-check"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::SecretsManager::Secret",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "SECRETSMANAGER_SCHEDULED_ROTATION_SUCCESS_CHECK"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.securityhub_enabled will be created
  + resource "aws_config_config_rule" "securityhub_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-securityhub-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "SECURITYHUB_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.sns_encrypted_kms will be created
  + resource "aws_config_config_rule" "sns_encrypted_kms" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-sns-encrypted-kms"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::SNS::Topic",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "SNS_ENCRYPTED_KMS"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.vpc_default_security_group_closed will be created
  + resource "aws_config_config_rule" "vpc_default_security_group_closed" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-vpc-default-security-group-closed"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::SecurityGroup",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "VPC_DEFAULT_SECURITY_GROUP_CLOSED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.vpc_flow_logs_enabled will be created
  + resource "aws_config_config_rule" "vpc_flow_logs_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-vpc-flow-logs-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "VPC_FLOW_LOGS_ENABLED"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.vpc_sg_open_only_to_authorized_ports will be created
  + resource "aws_config_config_rule" "vpc_sg_open_only_to_authorized_ports" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + input_parameters = jsonencode(
            {
              + authorizedTcpPorts = "443"
              + authorizedUdpPorts = "1020-1025"
            }
        )
      + name             = "fedramp-vpc-sg-open-only-to-authorized-ports"
      + rule_id          = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::SecurityGroup",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "VPC_SG_OPEN_ONLY_TO_AUTHORIZED_PORTS"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.vpc_vpn_2_tunnels_up will be created
  + resource "aws_config_config_rule" "vpc_vpn_2_tunnels_up" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-vpc-vpn-2-tunnels-up"
      + rule_id = (known after apply)

      + scope {
          + compliance_resource_types = [
              + "AWS::EC2::VPNConnection",
            ]
        }

      + source {
          + owner             = "AWS"
          + source_identifier = "VPC_VPN_2_TUNNELS_UP"
        }
    }

  # module.main.module.config_fedramp_conformance.aws_config_config_rule.wafv2_logging_enabled will be created
  + resource "aws_config_config_rule" "wafv2_logging_enabled" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + name    = "fedramp-wafv2-logging-enabled"
      + rule_id = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "WAFV2_LOGGING_ENABLED"
        }
    }

Plan: 111 to add, 3 to change, 0 to destroy.